In [2]:
import sqlite3

In [8]:
conn=sqlite3.connect("mytest.db")
cursor=conn.cursor()

In [10]:
sql='''create table students(name text, username text, id int)'''
cursor.execute(sql)
cursor.close()

In [12]:
conn=sqlite3.connect("mytest.db")
cursor=conn.cursor()
sql='''insert into students (name, username, id) values ('Fred Lowe', 'flowe', 363)'''
cursor.execute(sql)
cursor.close()

In [13]:
cursor=conn.cursor()
sql='''select * from students'''
results=cursor.execute(sql)
all_students=results.fetchall()
for student in all_students:
    print student

(u'Fred Lowe', u'flowe', 363)

In [1]:
import pandas as pd

conn=sqlite3.connect("sunspots.db")
cursor=conn.cursor()
sql='''select * from sunspots'''
results=cursor.execute(sql)
spots=results.fetchall()

for spot in spots:
    print spot

NameError: name 'sqlite3' is not defined

In [15]:
with sqlite3.connect("sensors.db") as con:
    c=con.cursor()
    
    c.execute('''CREATE TABLE sensors(date text, city text, code text, sensor_id real, temperature real)''')
    
    for table in c.execute("SELECT name FROM sqlite_master WHERE type='table'"):
        print type(table)
        print "Table", table[0]
        
    c.execute("INSERT INTO sensors VALUES ('2016-11-05','Utrecht','Red',42,15.14)")
    c.execute("SELECT * FROM sensors")
    
    print c.fetchone()

<type 'tuple'>
Table sensors
(u'2016-11-05', u'Utrecht', u'Red', 42.0, 15.14)

In [23]:
import statsmodels.api as sm
from pandas.io.sql import read_sql
import sqlite3

with sqlite3.connect("sunspots.db") as con:
    c=con.cursor()
    
    data_loader=sm.datasets.sunspots.load_pandas()
    df=data_loader.data 
    print type(df)
    
    rows=[tuple(x) for x in df.values]
    
    con.execute("CREATE TABLE sunspots(year, sunactivity)")
    con.executemany("INSERT INTO sunspots(year, sunactivity) VALUES (?,?)", rows)
    c.execute("SELECT COUNT(*) FROM sunspots") 
    print c.fetchone()
    
    print read_sql("SELECT * FROM sunspots where year < 1732", con)
    
    #con.execute("DROP TABLE sunspots")
    c.close()

<class 'pandas.core.frame.DataFrame'>
(309,)
    year  sunactivity
0   1700            5
1   1701           11
2   1702           16
3   1703           23
4   1704           36
5   1705           58
6   1706           29
7   1707           20
8   1708           10
9   1709            8
10  1710            3
11  1711            0
12  1712            0
13  1713            2
14  1714           11
15  1715           27
16  1716           47
17  1717           63
18  1718           60
19  1719           39
20  1720           28
21  1721           26
22  1722           22
23  1723           11
24  1724           21
25  1725           40
26  1726           78
27  1727          122
28  1728          103
29  1729           73
30  1730           47
31  1731           35

In [17]:
from sqlalchemy.ext.declarative import declarative_base

In [18]:
Base = declarative_base()

In [25]:
import statsmodels.api as sm
from pandas.io.sql import read_sql
import sqlite3

with sqlite3.connect("sunspots.db") as con:
    c=con.cursor()
      
    test=read_sql("SELECT * FROM sunspots where year < 1732", con)
    
    print type(test)
    #con.execute("DROP TABLE sunspots")
    c.close()

<class 'pandas.core.frame.DataFrame'>

In [26]:
test.head()

   year  sunactivity
0  1700            5
1  1701           11
2  1702           16
3  1703           23
4  1704           36

In [29]:
test[(test.year>=1703)&(test.year<=1711)]

    year  sunactivity
3   1703           23
4   1704           36
5   1705           58
6   1706           29
7   1707           20
8   1708           10
9   1709            8
10  1710            3
11  1711            0

In [30]:
from sqlalchemy.ext.declarative import declarative_base